In [1]:
import pandas as pd

## csv

In [3]:
data = {'name' :['Jerry', 'Riah', 'Paul'], 
        'algol':['A','A+','B'],
        'python':['A','A+','B'],
        'SQL':['A','A+','B']}
df = pd.DataFrame(data)
df.set_index('name', inplace = True)
print(df)

      algol python SQL
name
Jerry     A      A   A
Riah     A+     A+  A+
Paul      B      B   B

In [5]:
df.to_csv('./datasets/df_sample.csv')

In [29]:
df_read_csv = pd.read_csv('./datasets/df_sample.csv', index_col = 'name') # 'name'컬럼을 인덱스로 변경
print(df_read_csv)

      algol python SQL
name
Jerry     A      A   A
Riah     A+     A+  A+
Paul      B      B   B

In [22]:
df_read_csv = pd.read_csv('./datasets/df_sample.csv')
df_read_csv

    name algol python SQL
0  Jerry     A      A   A
1   Riah    A+     A+  A+
2   Paul     B      B   B

In [23]:
df_read_csv = pd.read_csv('./datasets/df_sample2.csv', index_col=0)
df_read_csv

      algol python SQL
name
Jerry     A      A   A
Riah     A+     A+  A+
Paul      B      B   B

In [24]:
df_read_csv = pd.read_csv('./datasets/df_sample2.csv')
df_read_csv

    name algol python SQL
0  Jerry     A      A   A
1   Riah    A+     A+  A+
2   Paul     B      B   B

In [21]:
df_read_csv.to_csv('./datasets/df_sample2.csv', index = False)

In [25]:
df.to_json('./datasets/df_sample.json')

In [26]:
df_json = pd.read_json('./datasets/df_sample.json')
df_json

      algol python SQL
Jerry     A      A   A
Riah     A+     A+  A+
Paul      B      B   B

In [28]:
df.to_excel('./datasets/df_sample.xlsx')